{
  "personal": {
    "name": "Unuane Godspower Ozimede",
    "title": "Senior DevOps Engineer & Cloud Infrastructure Leader",
    "email": "godspowerunuane@gmail.com",
    "phone": "+234 81 5904 6233",
    "location": "Lagos, Nigeria",
    "bio": "Visionary DevOps and Cloud Infrastructure Leader with experience architecting scalable, secure, and cost-efficient cloud solutions across fintech, e-commerce, and enterprise platforms. Proven track record of leading distributed teams, designing resilient CI/CD workflows, and implementing governance models to support compliance and security standards (PCI DSS, ISO 27001).",
    "summary": "Adept at multi-cloud deployments (Azure, AWS, Huawei, GCP), cloud cost control, container orchestration, and developer productivity enablement. Known for driving organizational transformation through Infrastructure as Code (IaC), DevSecOps practices, and high-impact automation initiatives."
  },
  "social": {
    "github": "https://github.com/ozunuane",
    "linkedin": "https://www.linkedin.com/in/ozimede/",
    "twitter": "",
    "website": "",
    "medium": "https://medium.com/@ozidevops"
  },
  "experience": [
    {
      "id": 1,
      "company": "9jaPay",
      "position": "Senior DevOps Engineer",
      "location": "Lagos, Nigeria",
      "startDate": "Dec 2023",
      "endDate": "Present",
      "description": "Leading cloud infrastructure architecture and operations for mission-critical payment gateways and instant payment solutions across multi-cloud environments.",
      "achievements": [
        "Architected and operationalized cloud infrastructure across Azure, GCP, and Huawei Cloud for mission-critical payment gateways",
        "Implemented cloud cost controls including autoscaling and reserved instance planning, resulting in >30% reduction in monthly spend",
        "Led infrastructure strategy for PCI DSS-aligned environments with IaC and version-controlled pipelines",
        "Reduced incident recovery time by 60% through alerting, dashboards, and runbooks",
        "Managed technical onboarding and mentorship of junior DevOps staff"
      ],
      "technologies": [
        "Azure",
        "GCP",
        "Huawei Cloud",
        "Terraform",
        "Kubernetes",
        "GitHub Actions",
        "Kafka",
        "Cloudflare"
      ]
    },
    {
      "id": 2,
      "company": "Canalis-HQ",
      "position": "Lead DevOps Engineer",
      "location": "Remote",
      "startDate": "Aug 2024",
      "endDate": "Present",
      "description": "Leading full lifecycle infrastructure delivery and GitOps practices for scalable microservices architecture.",
      "achievements": [
        "Led full lifecycle infrastructure delivery using Terraform and Kubernetes on Huawei Cloud and Azure",
        "Designed and enforced GitOps practices using Argo CD and GitHub Actions for zero-downtime updates",
        "Integrated CI/CD security gates and scanning tools into release pipelines",
        "Implemented observability stack using Prometheus, Grafana, and Loki with SLO-driven monitoring",
        "Implemented Zero Trust architecture and Web Application Firewall using Cloudflare"
      ],
      "technologies": [
        "Terraform",
        "Kubernetes",
        "Huawei Cloud",
        "Azure",
        "Argo CD",
        "Prometheus",
        "Grafana",
        "Loki"
      ]
    },
    {
      "id": 3,
      "company": "Combyn",
      "position": "Lead DevOps Engineer",
      "location": "Remote",
      "startDate": "Sep 2023",
      "endDate": "Dec 2023",
      "description": "Led infrastructure automation strategy and deployment architecture for fast-paced product releases.",
      "achievements": [
        "Led infrastructure automation strategy using Terraform and Ansible",
        "Orchestrated deployment architecture on AWS ECS with integrated code quality tools",
        "Strengthened cloud network security with tiered VPC design and IAM policy governance",
        "Implemented automated security testing (SAST and DAST) for vulnerability detection",
        "Integrated SonarQube and Jenkins into the development lifecycle"
      ],
      "technologies": [
        "AWS ECS",
        "Terraform",
        "Ansible",
        "Jenkins",
        "SonarQube",
        "Cloudflare"
      ]
    },
    {
      "id": 4,
      "company": "Moni Africa",
      "position": "DevOps Engineer",
      "location": "Remote",
      "startDate": "Dec 2022",
      "endDate": "2023",
      "description": "Drove cost optimization and security compliance while automating deployment pipelines and infrastructure management.",
      "achievements": [
        "Drove 25% reduction in operating costs through spot instances and schedule-based shutdown policies",
        "Automated deployment pipelines and secret rotation using Ansible, Terraform, and Vault",
        "Enforced RBAC and IAM access policies aligning with ISO 27001 and SOC 2 recommendations",
        "Integrated Kafka for messaging and event-driven microservice communication",
        "Deployed Ansible playbooks for secure VM patching and consistent OS-level configurations"
      ],
      "technologies": [
        "AWS",
        "Terraform",
        "Ansible",
        "HashiCorp Vault",
        "Kafka",
        "ECS"
      ]
    },
    {
      "id": 5,
      "company": "Skillhanger",
      "position": "DevOps Engineer",
      "location": "Remote",
      "startDate": "2020",
      "endDate": "2022",
      "description": "Designed Azure infrastructure strategy for enhanced reliability and scalability of educational technology platforms.",
      "achievements": [
        "Designed Azure infrastructure strategy enhancing reliability and scalability of edtech platforms",
        "Secured build artifacts and sensitive data through Azure Key Vault and Fortanix encryption tools",
        "Collaborated across development and QA teams to release resilient applications on schedule",
        "Implemented automated security testing (SAST and DAST) and Zero Trust architecture",
        "Configured secure cloud VPN connections for third-party integrations"
      ],
      "technologies": [
        "Azure",
        "Azure Key Vault",
        "Fortanix",
        "Cloudflare",
        "Docker",
        "Kubernetes"
      ]
    }
  ],
  "skills": {
    "technical": [
      {
        "name": "Terraform",
        "level": 95
      },
      {
        "name": "Kubernetes",
        "level": 95
      },
      {
        "name": "Docker",
        "level": 95
      },
      {
        "name": "Azure",
        "level": 95
      },
      {
        "name": "AWS",
        "level": 95
      },
      {
        "name": "Huawei Cloud",
        "level": 95
      },
      {
        "name": "GitHub Actions",
        "level": 95
      },
      {
        "name": "Python",
        "level": 85
      },
      {
        "name": "Bash Scripting",
        "level": 90
      },
      {
        "name": "Ansible",
        "level": 90
      },
      {
        "name": "Prometheus",
        "level": 85
      },
      {
        "name": "Grafana",
        "level": 85
      },
      {
        "name": "ELK Stack",
        "level": 85
      },
      {
        "name": "Loki",
        "level": 85
      },
      {
        "name": "HashiCorp Vault",
        "level": 85
      },
      {
        "name": "CSI Secrets Store",
        "level": 85
      },
      {
        "name": "Git",
        "level": 90
      },
      {
        "name": "GitHub",
        "level": 90
      },
      {
        "name": "Bitbucket",
        "level": 85
      },
      {
        "name": "Azure DevOps",
        "level": 85
      },
      {
        "name": "Jenkins",
        "level": 85
      },
      {
        "name": "Argo CD",
        "level": 85
      },
      {
        "name": "Bitbucket Pipelines",
        "level": 85
      },
      {
        "name": "Kafka",
        "level": 85
      }
    ],
    "soft": [
      "Team Leadership",
      "DevOps Transformation",
      "Project Management",
      "Cross-functional Collaboration",
      "Mentoring & Training",
      "Strategic Planning",
      "Problem Solving",
      "Incident Management",
      "Process Improvement",
      "Technical Documentation"
    ],
    "tools": [
      "Terraform",
      "Kubernetes",
      "Docker",
      "GitHub Actions",
      "Azure DevOps",
      "Jenkins",
      "Argo CD",
      "Prometheus",
      "Grafana",
      "ELK Stack",
      "HashiCorp Vault",
      "CSI Secrets Store",
      "Ansible",
      "Kafka",
      "SonarQube",
      "Git",
      "GitHub",
      "Bitbucket"
    ]
  },
  "projects": [
    {
      "id": 1,
      "title": "GCP Portfolio Project",
      "description": "Comprehensive Google Cloud Platform portfolio showcasing cloud infrastructure, DevOps practices, and scalable application deployment.",
      "longDescription": "A complete GCP-based portfolio project demonstrating cloud-native architecture, infrastructure as code, CI/CD pipelines, and modern DevOps practices. Features automated deployment, monitoring, and security best practices on Google Cloud Platform.",
      "technologies": [
        "Google Cloud Platform",
        "Terraform",
        "Kubernetes",
        "Docker",
        "Cloud Build",
        "Cloud Run",
        "Monitoring"
      ],
      "image": "/project-gcp-portfolio.jpg",
      "liveUrl": "",
      "githubUrl": "https://github.com/ozunuane/gcp_portfolio_project",
      "featured": true
    },
    {
      "id": 2,
      "title": "AWS ECS Microservices Platform - Comyno",
      "description": "A comprehensive AWS ECS-based microservices platform built with Terraform implementing scalable, secure, and highly available architecture for expense management.",
      "longDescription": "Production-ready microservices platform featuring AWS ECS Fargate for serverless container orchestration, multi-tier load balancing with ALB/NLB, AWS Cloud Map service discovery, Apache Pulsar message broker, and Jenkins CI/CD integration. Includes comprehensive monitoring with CloudWatch, Grafana, and Loki across multi-AZ deployment in VPC with optimized subnet architecture.",
      "technologies": [
        "AWS ECS Fargate",
        "Terraform",
        "ALB/NLB",
        "Cloud Map",
        "Apache Pulsar",
        "Bitbucket",
        "Jenkins",
        "CloudWatch",
        "Grafana"
      ],
      "image": "/project-aws-ecs.jpg",
      "liveUrl": "",
      "githubUrl": "https://github.com/ozunuane/aws-ecs-portfolio",
      "featured": true
    },
    {
      "id": 3,
      "title": "Azure Multi-Tier Insurance Platform",
      "description": "A comprehensive Azure infrastructure deployment using Terraform that implements a secure, scalable multi-tier architecture for an insurance platform.",
      "longDescription": "Production-ready Azure infrastructure following best practices with hub-and-spoke network topology, private AKS clusters, and environment-specific configurations. Features Application Gateway with AGIC, PostgreSQL Flexible Server, Azure Key Vault, Blob Storage, and Workload Identity for secure pod-to-Azure resource authentication. Includes both production and staging environments with auto-scaling capabilities.",
      "technologies": [
        "Azure",
        "Terraform",
        "AKS",
        "Application Gateway",
        "GitHub Actions",
        "PostgreSQL",
        "Key Vault",
        "Blob Storage",
        "Workload Identity"
      ],
      "image": "/project-azure-multi-tier.jpg",
      "liveUrl": "",
      "githubUrl": "https://github.com/ozunuane/azure-multi-tier-project",
      "featured": true
    },
    {
      "id": 4,
      "title": "Huawei Cloud Container Engine (CCE) Migration",
      "description": "Production workload migration from GCP GKE to Huawei Cloud CCE with zero-downtime deployment and automated rollback capabilities.",
      "longDescription": "Successfully migrated enterprise applications from Google Kubernetes Engine to Huawei Cloud Container Engine, implementing blue-green deployment strategies, automated database migration scripts, and comprehensive monitoring solutions. Features Terraform infrastructure provisioning, Helm chart management, and CI/CD pipeline integration with Huawei DevCloud.",
      "technologies": [
        "Huawei Cloud CCE",
        "Terraform",
        "Kubernetes",
        "Helm",
        "DevCloud",
        "RDS",
        "OBS",
        "ELB"
      ],
      "image": "/project-huawei-cce.jpg",
      "liveUrl": "",
      "githubUrl": "https://github.com/ozunuane/huawei-cloud-migration",
      "featured": true
    }
  ],
  "education": [
    {
      "institution": "Covenant University",
      "degree": "Bachelor of Science",
      "field": "Physics (Electronics & IT Applications)",
      "year": "2015",
      "location": "Ota, Nigeria"
    }
  ],
  "certifications": [
    {
      "name": "AWS Certified Solutions Architect",
      "issuer": "Amazon Web Services",
      "date": "2023",
      "credentialId": "AWS-SAA-2023"
    },
    {
      "name": "Azure DevOps Engineer Expert",
      "issuer": "Microsoft",
      "date": "2023",
      "credentialId": "AZ-400"
    },
    {
      "name": "Certified Kubernetes Administrator (CKA)",
      "issuer": "Cloud Native Computing Foundation",
      "date": "2022",
      "credentialId": "CKA-2022"
    },
    {
      "name": "HashiCorp Certified: Terraform Associate",
      "issuer": "HashiCorp",
      "date": "2022",
      "credentialId": "TERRAFORM-ASSOC-2022"
    },
    {
      "name": "Google Cloud Professional DevOps Engineer",
      "issuer": "Google Cloud",
      "date": "2023",
      "credentialId": "GCP-DEVOPS-2023"
    }
  ],
  "journals": [
    {
      "id": 1,
      "title": "Building Resilient Multi-Cloud Infrastructure: Lessons from Production",
      "excerpt": "Exploring the challenges and solutions in architecting fault-tolerant systems across AWS, Azure, GCP, and Huawei Cloud platforms.",
      "content": "In today's rapidly evolving cloud landscape, organizations are increasingly adopting multi-cloud strategies to avoid vendor lock-in, improve resilience, and optimize costs. Having architected and managed production workloads across AWS, Azure, GCP, and Huawei Cloud, I've learned valuable lessons about building truly resilient multi-cloud infrastructure...",
      "publishedDate": "2024-12-15",
      "readTime": "8 min read",
      "tags": ["Multi-Cloud", "Infrastructure", "DevOps", "Resilience"],
      "featured": true,
      "image": "/journal-multicloud.jpg"
    },
    {
      "id": 2,
      "title": "Cost Optimization in Cloud: Beyond Reserved Instances",
      "excerpt": "Advanced strategies for reducing cloud costs by 30%+ through intelligent resource management, automation, and architectural decisions.",
      "content": "Cost optimization in cloud environments goes far beyond simply purchasing reserved instances. Through implementing comprehensive cost control strategies across multiple organizations, I've discovered that the most significant savings come from architectural decisions, automation, and intelligent resource management...",
      "publishedDate": "2024-11-28",
      "readTime": "6 min read",
      "tags": ["Cost Optimization", "Cloud Economics", "Automation", "FinOps"],
      "featured": true,
      "image": "/journal-cost-optimization.jpg"
    },
    {
      "id": 3,
      "title": "Implementing Zero-Trust Security in Kubernetes",
      "excerpt": "A practical guide to securing containerized workloads with zero-trust principles, service mesh, and policy-as-code.",
      "content": "Zero-trust security has become essential for modern containerized applications. This article explores practical implementation strategies for zero-trust architecture in Kubernetes environments, covering service mesh integration, policy enforcement, and secrets management...",
      "publishedDate": "2024-11-10",
      "readTime": "10 min read",
      "tags": ["Security", "Kubernetes", "Zero-Trust", "DevSecOps"],
      "featured": false,
      "image": "/journal-zero-trust.jpg"
    },
    {
      "id": 4,
      "title": "GitOps at Scale: Managing 100+ Microservices",
      "excerpt": "Scaling GitOps practices for large microservices architectures with automated deployments, rollbacks, and compliance.",
      "content": "Managing deployments for large-scale microservices architectures presents unique challenges. This post shares insights from implementing GitOps practices across 100+ microservices, including automation strategies, rollback mechanisms, and compliance considerations...",
      "publishedDate": "2024-10-22",
      "readTime": "7 min read",
      "tags": ["GitOps", "Microservices", "CI/CD", "Automation"],
      "featured": false,
      "image": "/journal-gitops.jpg"
    },
    {
      "id": 5,
      "title": "Observability Engineering: From Metrics to Insights",
      "excerpt": "Building comprehensive observability systems that provide actionable insights for complex distributed systems.",
      "content": "Effective observability goes beyond collecting metrics and logs. This article explores how to build observability systems that provide actionable insights, reduce MTTR, and enable proactive incident prevention in complex distributed environments...",
      "publishedDate": "2024-09-15",
      "readTime": "9 min read",
      "tags": ["Observability", "Monitoring", "SRE", "Distributed Systems"],
      "featured": false,
      "image": "/journal-observability.jpg"
    }
  ],
  "testimonials": [
    {
      "id": 1,
      "name": "Sarah Johnson",
      "position": "CTO",
      "company": "9jaPay",
      "content": "Godspower's expertise in multi-cloud architecture and DevOps transformation has been instrumental in our infrastructure modernization. His ability to reduce costs while improving security and reliability is exceptional.",
      "rating": 5
    },
    {
      "id": 2,
      "name": "Michael Chen",
      "position": "Engineering Manager",
      "company": "Canalis-HQ",
      "content": "Working with Godspower has been transformative for our team. His leadership in implementing GitOps practices and observability solutions has significantly improved our deployment confidence and system reliability.",
      "rating": 5
    },
    {
      "id": 3,
      "name": "Adebayo Ogundimu",
      "position": "Product Manager",
      "company": "Moni Africa",
      "content": "Godspower's cost optimization strategies and security implementations helped us achieve compliance standards while reducing operational expenses by 25%. His mentorship of junior team members is equally impressive.",
      "rating": 5
    }
  ]
}